Revit 2027 API
ExportIFCCategoryKey(String, String, CustomSubCategoryId) Constructor
 Constructs a new ExportIFCCategoryKey with category, subcategory names and special id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExportIFCCategoryKey(
	string categoryName,
	string subCategoryName,
	CustomSubCategoryId customSubCategoryId
)
Public Sub New (
	categoryName As String,
	subCategoryName As String,
	customSubCategoryId As CustomSubCategoryId
)
public:
ExportIFCCategoryKey(
	String^ categoryName,
	String^ subCategoryName,
	CustomSubCategoryId customSubCategoryId
)
new :
        categoryName : string *
        subCategoryName : string *
        customSubCategoryId : CustomSubCategoryId -> ExportIFCCategoryKey
Parameters
categoryName String
 The Revit category name.
subCategoryName String
 The Revit subcategory name.
customSubCategoryId CustomSubCategoryId
 The Revit custom subcategory id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ExportIFCCategoryKey Class
ExportIFCCategoryKey Overload
Autodesk.Revit.DB Namespace